FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>В регистре хранятся значения дополнительных свойств объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект (справочник или документ) для которого существуют и могут быть назначены дополнительные свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НазначенияСвойствОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Вид свойства</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Поле в котором хранится телефонный номер</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ЗвонкиМанго.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗвонкиМанго</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РезультатПеревода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>entry_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>Типы контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>E-Mail</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>Веб-страница</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерICQ</Name>
					<Comment>Номер ICQ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>Другая контактная информация (произвольная)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Пользователи системы</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании, к которому относится пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, к которой относится пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПрав</Name>
					<Comment>Права берутся от другого пользователя, указанного в этом реквизите</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимИспользованияОборудования</Name>
					<Comment>0 - обычный режим, 1 - локальное оборудование недоступно для других, 2 - запрещено любое использование оборудования</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяШаблоном</Name>
					<Comment>Является шаблоном</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>Содержит ссылку на график работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольККМ</Name>
					<Comment>пароль-идентификатор кассира при работе с КММ(ФР)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФункциональнойПанели</Name>
					<Comment>Настройка функциональной панели</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиФункциональнойПанели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпТекущийВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинНаМобильномУстройстве</Name>
					<Comment>Логин на мобильном устройстве</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольНаМобильномУстройстве</Name>
					<Comment>Пароль на мобильном устройстве</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиАРМОтчеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкиАРМОтчеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/MangoПользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>MangoПользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияЗвонков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоГруппаMango</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/ТТ_Mango/Ext/Module.bsl
//MANGO
Процедура ДобавитьЗаписьРазговораВрегистр(СтруктураДанных) Экспорт
	
	Если СтруктураДанных.Свойство("recording_state") И СтруктураДанных.recording_state="Completed" Тогда
		РС=РегистрыСведений.MangoЗаписиРазговоров.СоздатьМенеджерЗаписи();
		РС.Дата=ТекущаяДата();
		Если СтруктураДанных.Свойство("extension") Тогда
			РС.НомерТелефона=СтруктураДанных.extension;
		КонецЕсли;
		РС.recording_id=СтруктураДанных.recording_id;
		РС.call_id=СтруктураДанных.call_id;
		РС.entry_id=СтруктураДанных.entry_id;
		РС.Записать();		
	КонецЕсли	
	
КонецПроцедуры

Процедура ДобавитьЗвонок(СтруктураДанных) Экспорт
	
	Если СтруктураДанных.call_state <> "Connected" Тогда  //обновил call_id
		
		РС = РегистрыСведений.РегистрацияЗвонковИКонтактов.СоздатьНаборЗаписей();
		РС.Отбор.entry_id.Установить(СтруктураДанных.entry_id);
		РС.Прочитать();
		Если РС.Количество()>0 Тогда
			Для Каждого Запись Из РС Цикл
				Запись.call_id=СтруктураДанных.call_id;
			КонецЦикла;
			РС.Записать();
		КонецЕсли;
		
		Возврат;
		
	ИначеЕсли СтруктураДанных.call_state="Connected" Тогда
		
		РС = РегистрыСведений.РегистрацияЗвонковИКонтактов.СоздатьНаборЗаписей();
		РС.Отбор.entry_id.Установить(СтруктураДанных.entry_id);
		РС.Прочитать();
		Если РС.Количество()>0 Тогда     //Уже есть звонок
			Для Каждого Запись Из РС Цикл
				Запись.call_id=СтруктураДанных.call_id;
			КонецЦикла;
			РС.Записать();
			
			Возврат;
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	 
	//Если внутр. звонок то не пишем его	
	Если НЕ СтруктураДанных.Свойство("extension")
		И СтруктураДанных.Свойство("from") 
		И СтруктураДанных.from.Свойство("number") 
		Тогда		
		ВходящийНомер=СокрЛП(СтруктураДанных.from.number);
		Если СтрДлина(ВходящийНомер) < 5 Тогда Возврат; КонецЕсли; 	
		Если СтрНайти(ВходящийНомер,"mango") > 0 Тогда Возврат; КонецЕсли; 	 //Внутренние звонки с sip?
	Иначе
		Возврат;
	КонецЕсли;	
	
	Если СтруктураДанных.Свойство("to") 
		И СтруктураДанных.to.Свойство("extension") 
		Тогда		
		НомерСотрудника=СокрЛП(СтруктураДанных.to.extension);	
	Иначе
		Возврат;
	КонецЕсли;	
	
	Сотрудник=ОпределитьСотрудникаПоНомеру(НомерСотрудника);	
	
	Если Сотрудник.Пустая() Тогда //регистрируем только определенные номера
		Если СтруктураДанных.Свойство("to") 
			И СтруктураДанных.to.Свойство("acd_group") Тогда
			НомерГруппы=СокрЛП(СтруктураДанных.to.acd_group);	
			
			Сотрудник=ОпределитьСотрудникаПоНомеруГруппы(НомерГруппы);
			Если Сотрудник.Пустая() Тогда 			
				Возврат;
			КонецЕсли;
		Иначе
			Возврат;			
		КонецЕсли;
	КонецЕсли;
	
	ТекДата=ТекущаяДата();
	
	ДанныеОКлиенте = ПолучитьДанныеОКлиенте(ВходящийНомер, ТекДата);
	Клиент = ДанныеОКлиенте.Клиент;
	Если Клиент = Неопределено Тогда
		Клиент = Справочники.Контрагенты.НайтиПоКоду("ЦБ043270");     //Неопределено
	КонецЕсли;
	
	Автор=Справочники.Пользователи.НайтиПоНаименованию("mango"); //mango
	
	Организация = Сотрудник.Организация;
	Подразделение = Сотрудник.Подразделение;
	
	НоваяЗапись = РегистрыСведений.РегистрацияЗвонковИКонтактов.СоздатьМенеджерЗаписи();

	НоваяЗапись.Автор = Автор;  
	НоваяЗапись.ДатаДень =ТекДата;
	НоваяЗапись.ДатаВремя = ТекДата;
	НоваяЗапись.ПредставлениеТелефона = ВходящийНомер;  
	НоваяЗапись.Сотрудник = Сотрудник;
	НоваяЗапись.Клиент = Клиент;
	НоваяЗапись.ВидКонтакта = Перечисления.ВидыСобытий.ТелефонныйЗвонок;
	НоваяЗапись.Организация = Организация; 
	НоваяЗапись.Подразделение = Подразделение;
	НоваяЗапись.Примечание = ДанныеОКлиенте.Примечание;
	НоваяЗапись.ВторичныйКонтакт = ДанныеОКлиенте.ВторичныйКонтакт;
	НоваяЗапись.ПредметОбращения = Справочники.ПредметыОбращения.Прочее; // По умолчанию Прочее
	НоваяЗапись.call_id			= СтруктураДанных.call_id; 	
	НоваяЗапись.entry_id		= СтруктураДанных.entry_id;
	НоваяЗапись.Записать();
	
	ТекОбъект = Документы.Событие.СоздатьДокумент();
	
	МенеджерЗаписи = РегистрыСведений.РегистрацияЗвонковИКонтактов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,НоваяЗапись);
	МенеджерЗаписи.Прочитать();
	
	СтруктураСтроки	= Новый Структура();
	СтруктураСтроки.Вставить("Имя",						"РегистрацияЗвонковИКонтактов");
	СтруктураСтроки.Вставить("Автор",					Автор);
	СтруктураСтроки.Вставить("ДатаДень",				МенеджерЗаписи.ДатаДень);
	СтруктураСтроки.Вставить("ДатаВремя",				МенеджерЗаписи.ДатаВремя);
	СтруктураСтроки.Вставить("Сотрудник",				МенеджерЗаписи.Сотрудник);
	СтруктураСтроки.Вставить("Контрагент",				МенеджерЗаписи.Клиент);
	СтруктураСтроки.Вставить("Организация",				МенеджерЗаписи.Организация);
	СтруктураСтроки.Вставить("ПодразделениеКомпании",	МенеджерЗаписи.Подразделение);
	СтруктураСтроки.Вставить("Модель",					МенеджерЗаписи.Модель);
	СтруктураСтроки.Вставить("ВидКонтакта",				МенеджерЗаписи.ВидКонтакта);
	СтруктураСтроки.Вставить("Реклама",					МенеджерЗаписи.Реклама);
	СтруктураСтроки.Вставить("ВторичныйКонтакт",		МенеджерЗаписи.ВторичныйКонтакт);
	СтруктураСтроки.Вставить("ЮридическоеЛицо",			МенеджерЗаписи.ЮридическоеЛицо);
	СтруктураСтроки.Вставить("Примечание",				МенеджерЗаписи.Примечание);
	СтруктураСтроки.Вставить("ПредметОбращения",		МенеджерЗаписи.ПредметОбращения);
	СтруктураСтроки.Вставить("Участник",				МенеджерЗаписи.Участник);
	СтруктураСтроки.Вставить("КодРегиона",				МенеджерЗаписи.КодРегиона);
	СтруктураСтроки.Вставить("КодГорода",				МенеджерЗаписи.КодГорода);
	СтруктураСтроки.Вставить("НомерТелефона",			МенеджерЗаписи.НомерТелефона);
	СтруктураСтроки.Вставить("ВнутреннийНомер",			МенеджерЗаписи.ВнутреннийНомер);
	СтруктураСтроки.Вставить("ПредставлениеТелефона",	МенеджерЗаписи.ПредставлениеТелефона);
	СтруктураСтроки.Вставить("ВидТелефона",				МенеджерЗаписи.ВидТелефона);
	
	ВремяСобытия = НачалоДня(МенеджерЗаписи.ДатаДень) + (МенеджерЗаписи.ДатаВремя - НачалоДня(МенеджерЗаписи.ДатаВремя));
	
	ТекОбъект.Заполнить(СтруктураСтроки);
	ТекОбъект.ДополнительныеСвойства.Вставить("УжеВВодилось", Истина);
	текоБъект.ОбменДанными.Загрузка = ИСТИНА;
	ТекОбъект.Дата = ВремяСобытия;
	ТекОбъект.Автор = Автор; 
	ТекОбъект.Организация = Сотрудник.Организация;
	ТекОбъект.ПодразделениеКомпании = Сотрудник.Подразделение;
	ТекОбъект.Тема = ?(МенеджерЗаписи.ВидКонтакта = Перечисления.ВидыСобытий.ТелефонныйЗвонок,"Телефонный звонок от "+ВремяСобытия,"Личная встреча от "+ВремяСобытия);			
	ТекОбъект.ДатаНачала = ВремяСобытия;
	текОбъект.ДатаОкончания = ВремяСобытия+60*15; 
	ТекОбъект.Состояние = Перечисления.СостоянияСобытий.Завершено;
	ТекОбъект.Приоритет = Перечисления.Важность.Средняя;
	ТекОбъект.Менеджер = Сотрудник; 
	ТекОбъект.ФорматТекста = Перечисления.ФорматТекста.ПростойТекст;
	ТекОбъект.ХозОперация = Справочники.ХозОперации.Событие;
	ТекОбъект.ТипСообщения = Перечисления.ТипыСообщений.Входящее;
	ТекОбъект.ПредставлениеТелефона=ВходящийНомер;
	ТекОбъект.УстановитьНовыйНомер();
	ТекОбъект.Записать();
	Текобъект.ОбменДанными.Загрузка=Ложь;	
	
	ТекОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ЗаписатьCallId(ТекОбъект.Ссылка, СтруктураДанных.call_id, СтруктураДанных.entry_id);
	
	МенеджерЗаписи.ДокументСобытие = ТекОбъект.Ссылка;
	
	//Попытка 
		МенеджерЗаписи.Записать();
	//Исключение
	//КонецПопытки;
	
	
КонецПроцедуры

Процедура ЗавершитьЗвонок(СтруктураДанных) Экспорт
	
	//Отметим как завершенный
	
	РС = РегистрыСведений.РегистрацияЗвонковИКонтактов.СоздатьНаборЗаписей();
	РС.Отбор.entry_id.Установить(СтруктураДанных.entry_id);
	РС.Прочитать();
	Если РС.Количество()>0 Тогда
		Для Каждого Запись Из РС Цикл
			Запись.ВызовЗавершен=Истина;
		КонецЦикла;
		РС.Записать();
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ЗаписатьCallId(ТекОбъект, call_id, entry_id) 
	
	РС=РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	РС.Объект=ТекОбъект;
	РС.Свойство=ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("entry_id");
	РС.Значение=entry_id;
	РС.Записать();
	
	//РС=РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	//РС.Объект=ТекОбъект;
	//РС.Свойство=ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("call_id");
	//РС.Значение=call_id;
	//РС.Записать();
	
КонецПроцедуры


Функция ПолучитьДанныеОКлиенте(НомерТелефона,Время)
	
	СтруктураДанныеОКлиенте = Новый Структура;
	
	СтруктураДанныеОКлиенте.Вставить("Клиент","Неопределено");
	СтруктураДанныеОКлиенте.Вставить("Менеджер",Неопределено);
	СтруктураДанныеОКлиенте.Вставить("Примечание","");	
	СтруктураДанныеОКлиенте.Вставить("ВторичныйКонтакт",Ложь);	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерТелефона","%"+Прав(НомерТелефона,7));
	
	//проверяем по раюочим листам
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	РабочийЛист.Ссылка,
	|	РабочийЛист.Контрагент КАК Клиент,
	|	РабочийЛист.Менеджер
	|ИЗ
	|	Документ.РабочийЛист КАК РабочийЛист
	|ГДЕ
	|	РабочийЛист.ПредставлениеТелефона ПОДОБНО &НомерТелефона
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочийЛист.Дата УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		СтруктураДанныеОКлиенте.Клиент = Выборка.Клиент;
		СтруктураДанныеОКлиенте.Менеджер = Выборка.Менеджер;
		СтруктураДанныеОКлиенте.ВторичныйКонтакт = Истина;
		СтруктураДанныеОКлиенте.Примечание = СтруктураДанныеОКлиенте.Менеджер;
		Возврат  СтруктураДанныеОКлиенте;
	КонецЕсли;
	
	//проверяем по списку звонков и контактов
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 2
	|	РегистрацияЗвонковИКонтактов.Клиент,
	|	РегистрацияЗвонковИКонтактов.ПредставлениеТелефона,
	|	РегистрацияЗвонковИКонтактов.ДатаДень,
	|	РегистрацияЗвонковИКонтактов.ДатаВремя КАК ДатаВремя
	|ИЗ
	|	РегистрСведений.РегистрацияЗвонковИКонтактов КАК РегистрацияЗвонковИКонтактов
	|ГДЕ
	|	РегистрацияЗвонковИКонтактов.ПредставлениеТелефона ПОДОБНО &НомерТелефона
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегистрацияЗвонковИКонтактов.ДатаДень УБЫВ,
	|	ДатаВремя УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 2 Тогда
		Выборка.Следующий();
		Выборка.Следующий();
		
		Если Формат(Выборка.ДатаВремя,"ДЛФ=В") <> Формат(Время,"ДЛФ=В") Тогда
			СтруктураДанныеОКлиенте.Клиент = Выборка.Клиент;
			СтруктураДанныеОКлиенте.ВторичныйКонтакт = Истина;
			
			//СтруктураДанныеОКлиенте.Примечание = "Дата предыдущего звонка: " + Формат(Выборка.ДатаДень,"ДФ=dd.MM.yyyy") +" "+ Формат(Выборка.ДатаВремя,"ДЛФ=В");
			Возврат  СтруктураДанныеОКлиенте;
		КонецЕсли;
		
	КонецЕсли;
	
	//проверяем по справочнику "Контрагенты"
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.ОсновнойТелефон,
	|	Контрагенты.Ссылка КАК Клиент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ОсновнойТелефон ПОДОБНО &НомерТелефона";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		СтруктураДанныеОКлиенте.Клиент = Выборка.Клиент;
		СтруктураДанныеОКлиенте.ВторичныйКонтакт = Истина;
		Возврат  СтруктураДанныеОКлиенте;
	КонецЕсли;
	
	//проверяем по регистру сведений "Контактная информация"
	Запрос.Текст = "ВЫБРАТЬ
	|	ПОДСТРОКА(КонтактнаяИнформация.Представление, 0, 100) КАК Адрес,
	|	КонтактнаяИнформация.Объект КАК Клиент
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтактный)
	|	И ПОДСТРОКА(КонтактнаяИнформация.Представление, 0, 100) ПОДОБНО &НомерТелефона
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		СтруктураДанныеОКлиенте.Клиент = Выборка.Клиент;
		СтруктураДанныеОКлиенте.ВторичныйКонтакт = Истина;
		Возврат  СтруктураДанныеОКлиенте;
	КонецЕсли;		
	
	Возврат  СтруктураДанныеОКлиенте;
	
КонецФункции

Функция ОпределитьСотрудникаПоНомеру(НомерСотрудника)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.MangoПользователи КАК MangoПользователи
		|		ПО КонтактнаяИнформация.Объект = MangoПользователи.Пользователь.Сотрудник
		|ГДЕ
		|	КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Вид = &Вид
		|	И MangoПользователи.РегистрацияЗвонков
		|	И КонтактнаяИнформация.Представление = &НомерСотрудника
		|	И MangoПользователи.ЭтоГруппаMango = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Номер Mango"));
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("НомерСотрудника", СокрЛП(НомерСотрудника));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Объект;
	КонецЦикла;
	
	Возврат Справочники.Сотрудники.ПустаяСсылка();
	
КонецФункции

Функция ОпределитьСотрудникаПоНомеруГруппы(НомерГруппы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.MangoПользователи КАК MangoПользователи
		|		ПО КонтактнаяИнформация.Объект = MangoПользователи.Пользователь.Сотрудник
		|ГДЕ
		|	КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Вид = &Вид
		|	И MangoПользователи.РегистрацияЗвонков
		|	И КонтактнаяИнформация.Представление = &НомерГруппы
		|	И MangoПользователи.ЭтоГруппаMango = ИСТИНА";
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Номер Mango"));
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("НомерГруппы", СокрЛП(НомерГруппы));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Объект;
	КонецЦикла;
	
	Возврат Справочники.Сотрудники.ПустаяСсылка();
	
КонецФункции

Процедура ОткрытьФормуЗаписейРазговора(Кнопка, ЭтаФорма, Ссылка) Экспорт
	
	Форма=Документы.Событие.ПолучитьФорму("ФормаЗаписиРазговора");
	РС=РегистрыСведений.MangoЗаписиРазговоров.СоздатьНаборЗаписей();
	entry_id=обПолучитьЗначениеСвойства(Ссылка,ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("entry_id"),"");
	Если entry_id="" Тогда 
		Сообщить("Записи разговора не найдены.");
		Возврат;
	КонецЕсли;
	РС.Отбор.entry_id.Установить(entry_id);
	РС.Прочитать();
	Если РС.Количество()>0 Тогда
		n=1;
		Для каждого Запись из РС Цикл
			НовСтр=Форма.ТабЗаписей.Добавить();
			НовСтр.НомерСтроки=n;
			НовСтр.recording_id=Запись.recording_id;
			НовСтр.Дата=Запись.Дата;
			n=n+1;
		КонецЦикла;
	Иначе
		Сообщить("Записи разговора не найдены.");
		Возврат;
	КонецЕсли;
	Форма.ЭлементыФормы.НадписьНомерТелефона.Заголовок="Номер телефона: "+Ссылка.ПредставлениеТелефона;
	Форма.Открыть();
	
	
КонецПроцедуры

Процедура СкачатьЗаписьРазговора(Ключ, ПутьДляСохранения) Экспорт
	
	ПараметрыЗапроса = Новый Структура;
    ПараметрыЗапроса.Вставить("recording_id", Ключ); 	
    ПараметрыЗапроса.Вставить("action", "download"); 	
	//ПараметрыЗапроса.Вставить("action", "play"); 	
	
	Ответ = ВыполнитьЗапрос("queries/recording/post", ПараметрыЗапроса);
	Если Ответ.КодСостояния=302 Тогда
		ПутьКФайлуHTTP=Ответ.Заголовки["Location"];
		
		ОтветПоФайлу = ПолучитьФайлЗаписи(ПутьКФайлуHTTP, ПутьДляСохранения);
		                                                   
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьФайлЗаписи(ПутьКФайлуHTTP, ПутьДляСохранения)
	
	ПутьКФайлуHTTP=СтрЗаменить(ПутьКФайлуHTTP, "https://files.mango-office.ru/", "");
	
	HTTPСоединение = Новый HTTPСоединение("files.mango-office.ru/",,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	
	Запрос = Новый HTTPЗапрос(ПутьКФайлуHTTP);
	
	//ПутьДляСохранения = КаталогВременныхФайлов()+"1.mp3";
	
	//Ответ = HTTPСоединение.Получить(Запрос, ПутьДляСохранения);
	
	////либо так
	Ответ = HTTPСоединение.Получить(Запрос);
	Ответ.ПолучитьТелоКакДвоичныеДанные().Записать(ПутьДляСохранения);
	
КонецФункции

Функция ВыполнитьЗапрос(АдресРесурса, ПараметрыЗапроса) Экспорт
	
	ApiKey  = "4drtmwxftas1zk7ggu7qvt7wnkded2w7";
    ApiSalt = "6dri0fojf6b4h9bnt84es105b4afwwdt";
	
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
    ЗаписатьJSON(ЗаписьJSON, ПараметрыЗапроса);
    СтрокаJSON = ЗаписьJSON.Закрыть();
        
    ХД = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХД.Добавить(ApiKey);
	ХД.Добавить(СтрокаJSON);
	ХД.Добавить(ApiSalt);
	Sign = НРег(СтрЗаменить(ХД.ХешСумма, " ", ""));
	
	HTTPСоединение = Новый HTTPСоединение("app.mango-office.ru/vpbx/",,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	
	СтрокаЗапроса = "vpbx_api_key="+КодироватьСтроку(ApiKey, СпособКодированияСтроки.КодировкаURL)+"&sign=" 
	+ КодироватьСтроку(Sign, СпособКодированияСтроки.КодировкаURL) 
	+ "&json=" + КодироватьСтроку(СтрокаJSON, СпособКодированияСтроки.КодировкаURL) + "";
	
	//СтрокаЗапроса = СтрШаблон("vpbx_api_key=%1&sign=%2&json=%3",
	//КодироватьСтроку(ApiKey, СпособКодированияСтроки.КодировкаURL),
	//КодироватьСтроку(sign, СпособКодированияСтроки.КодировкаURL),
	//КодироватьСтроку(СтрокаJSON, СпособКодированияСтроки.КодировкаURL));
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("accept", "application/json");
	ЗаголовкиHTTP.Вставить("Content-type", "application/x-www-form-urlencoded");
	ЗаголовкиHTTP.Вставить("Accept-Language", "en");
	ЗаголовкиHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовкиHTTP.Вставить("Content-Language", "en");
	ЗаголовкиHTTP.Вставить("Content-Charset", "utf-8");
	ЗаголовкиHTTP.Вставить("Content-Length",СтрДлина(СтрокаЗапроса)); 
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовкиHTTP);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса,КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
    Возврат HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);;
        
КонецФункции

Процедура ОповеститьОРезультатеПеревода(СтруктураДанных) Экспорт
	
	РС=РегистрыСведений.ЗвонкиМанго.СоздатьМенеджерЗаписи();
	Если СтруктураДанных.Свойство("command_id") Тогда
		РС.entry_id=СтруктураДанных.command_id;
		РС.РезультатПеревода = СтруктураДанных.result;
		РС.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтфильтроватьДубли()	
	////Фильтрация дублирущегося звонка если между ними меньше 30 сек
	//Если ПоследнийТелефонВремя <> Неопределено И Прав(СтруктураДанных.CallerId,7) = Прав(ПоследнийТелефон,7) И 
	//	СтруктураДанных.StartTime - Дата(ПоследнийТелефонВремя) < 30 Тогда 
	//	Возврат;
	//КонецЕсли;
	//Если ПоследнийТелефон2Время <> Неопределено И Прав(СтруктураДанных.CallerId,7) = Прав(ПоследнийТелефон2,7) И 
	//	СтруктураДанных.StartTime - Дата(ПоследнийТелефон2Время) <30 Тогда  	
	//	Возврат; 
	//КонецЕсли;
	
	
	//
	//НаборЗаписей = РегистрыСведений.РегистрацияЗвонковИКонтактов.СоздатьНаборЗаписей();
	//
	//НаборЗаписей.Отбор.ДатаВремя.Установить(СтрокаТаблицы.StartTime);
	//НаборЗаписей.Отбор.ДатаДень.Установить(СтрокаТаблицы.StartTime);
	//
	//НаборЗаписей.Прочитать();
	//
	//ПоследнийТелефон = СтрокаТаблицы.CallerId;
	//ПоследнийТелефонВремя = СтрокаТаблицы.StartTime; 
	//
	//ЗаписиЕсть = Ложь;
	//Для Каждого Запись Из НаборЗаписей Цикл
	//	Если Запись.ДатаВремя <> Неопределено Тогда
	//		ЗаписиЕсть = Истина;
	//	КонецЕсли;
	//КонецЦикла;	
	//Если ЗаписиЕсть Тогда
	//	Продолжить;
	//КонецЕсли;	
КонецПроцедуры

Процедура ОбратныйЗвонок(НомерТелефона) Экспорт
	
	Сотрудник=ПараметрыСеанса.Пользователь.Сотрудник;	
	
	Если НЕ обЗначениеНеЗаполнено(Сотрудник) Тогда
		ВнутрНомер=ОпределитьВнутрНомерСотрудника(Сотрудник);
		
		Если ВнутрНомер="" Тогда
			Сообщить("В справочнике сотрудника не назначен внутр. тел. Номер Mango! Вызов невозможен.");
			Возврат;		
		КонецЕсли;
	Иначе
		Сообщить("Для вашего пользователя не задан сотрудник!");
		Возврат;
	КонецЕсли;	
	
	ПараметрыЗапроса1 = Новый Структура;
	ПараметрыЗапроса1.Вставить("extension", ВнутрНомер); 	
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("command_id", "outcall"); 	
	ПараметрыЗапроса.Вставить("from", ПараметрыЗапроса1); 	
	ПараметрыЗапроса.Вставить("to_number", НомерТелефона); 	
	
	Ответ = ВыполнитьЗапрос("commands/callback", ПараметрыЗапроса);
	
	
КонецПроцедуры

Функция ОпределитьВнутрНомерСотрудника(Сотрудник) Экспорт
	
	ВнутрНомер="";
	
	Если НЕ обЗначениеНеЗаполнено(Сотрудник) Тогда
		РС=РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
		РС.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Телефон);
		РС.Отбор.Вид.Установить(Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Номер Mango"));
		РС.Отбор.Объект.Установить(Сотрудник);
		РС.Прочитать();
		
		Если РС.Количество()>0 Тогда
			ВнутрНомер=РС[0].Представление;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВнутрНомер;
	
КонецФункции

Процедура ЗаписатьвЖурнал(СтруктураДанных, method) Экспорт
	//
	//НоваяЗапись = РегистрыСведений.ЖурналMango.СоздатьМенеджерЗаписи();
	//ЗаполнитьЗначенияСвойств(НоваяЗапись,СтруктураДанных);
	//
	//Если НЕ СтруктураДанных.Свойство("extension")
	//	И СтруктураДанных.Свойство("from") 
	//	И СтруктураДанных.from.Свойство("number") 
	//	Тогда		
	//	ВходящийНомер=СтруктураДанных.from.number;
	//	Если СтрДлина(ВходящийНомер) > 4 И СтрНайти(ВходящийНомер,"mango") = 0 Тогда	
	//		НоваяЗапись.number=ВходящийНомер;
	//	КонецЕсли; 			
	//КонецЕсли;	
	//
	//Если СтруктураДанных.Свойство("to") 
	//	И СтруктураДанных.to.Свойство("extension") 
	//	Тогда		
	//	НомерСотрудника=СокрЛП(СтруктураДанных.to.extension);	
	//	НоваяЗапись.extension=НомерСотрудника;		
	//Иначе
	//	Возврат;
	//КонецЕсли;	
	//
	//НоваяЗапись.Дата=ТекущаяДата();
	//НоваяЗапись.method=method;
	//НоваяЗапись.Записать();

КонецПроцедуры
